# 编写一个程序，通过填充空格来解决数独问题。
#
#  数独的解法需 遵循如下规则：
#
#
#  数字 1-9 在每一行只能出现一次。
#  数字 1-9 在每一列只能出现一次。
#  数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图）
#
#
#  数独部分空格内已填入了数字，空白格用 '.' 表示。
#
#
#
#
#
#
#  示例：
#
#
# 输入：board = [["5","3",".",".","7",".",".",".","."],["6",".",".","1","9","5","."
# ,".","."],[".","9","8",".",".",".",".","6","."],["8",".",".",".","6",".",".","."
# ,"3"],["4",".",".","8",".","3",".",".","1"],["7",".",".",".","2",".",".",".","6"
# ],[".","6",".",".",".",".","2","8","."],[".",".",".","4","1","9",".",".","5"],["
# .",".",".",".","8",".",".","7","9"]]
# 输出：[["5","3","4","6","7","8","9","1","2"],["6","7","2","1","9","5","3","4","8"
# ],["1","9","8","3","4","2","5","6","7"],["8","5","9","7","6","1","4","2","3"],["
# 4","2","6","8","5","3","7","9","1"],["7","1","3","9","2","4","8","5","6"],["9","
# 6","1","5","3","7","2","8","4"],["2","8","7","4","1","9","6","3","5"],["3","4","
# 5","2","8","6","1","7","9"]]
# 解释：输入的数独如上图所示，唯一有效的解决方案如下所示：
#
#
#
#
#
#
#  提示：
#
#
#  board.length == 9
#  board[i].length == 9
#  board[i][j] 是一位数字或者 '.'
#  题目数据 保证 输入数独仅有一个解
#
#
#
#
#  Related Topics 数组 回溯 矩阵
#  👍 864 👎 0

from typing import List
# leetcode submit region begin(Prohibit modification and deletion)
class Solution:
    def solveSudoku(self, board: List[List[str]]) -> None:
        """
        Do not return anything, modify board in-place instead.
        """
        self.backtrack(board, 0, 0)


    def backtrack(self, board, i, j):
        if j == 9: #若一行填完数字，则进行下一行
            return self.backtrack(board, i+1, 0)
        if i == 9: #找到一个可行解，结束
            return True

        if board[i][j] != '.': #若有数字，则跳过
            return self.backtrack(board, i, j+1)

        for num in range(1, 10):
            if self.isvalid(board,i,j,num): #如果有效，则进行回溯，如无效，则跳过
                board[i][j] = str(num)
                if self.backtrack(board, i, j+1):#如果找到一个可行解，立即结束
                    return True
                board[i][j] = '.'
            else:
                continue
        return False


    def isvalid(self,board,r,c,num): #判断数字是否有效
        for i in range(9):
            if board[r][i] == str(num):
                return False
            if board[i][c] == str(num):
                return False
            if board[int(r/3)*3 + int(i/3)][int(c/3)*3 + int(i%3)] == str(num):#数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。
                return False
        return True

# leetcode submit region end(Prohibit modification and deletion)


solution = Solution()
